---
type: FilterDoubleRule
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# FilterDoubleRule

`Autodesk.Revit.DB.FilterDoubleRule` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | FilterDoubleRule | 2011 | `public FilterDoubleRule ( FilterableValueProvider valueProvider , FilterNumericRuleEvaluator evaluator , double ruleValue , double epsilon )` |
| Property | Epsilon | 2011 | `public double Epsilon { get ; set ; }` |
| Property | RuleValue | 2011 | `public double RuleValue { get ; set ; }` |